content-org/all-posts.org
#+startup: indent
#+startup: logdone
#+hugo_base_dir: ../
#+options: author:nil

* Rust: Trait Objects and the Newtype Pattern
:PROPERTIES:
:EXPORT_HUGO_SECTION: post
:EXPORT_FILE_NAME: rust-trait-objects-and-newtype-pattern
:END:

** Introduction
I built a simple Hacker News wrapper in Rust to learn about API design principles. Along the way I also discovered the [[https://rust-unofficial.github.io/patterns/patterns/behavioural/newtype.html][Newtype pattern]] which provides type safety and encapsulation. The following post is a summary of learnings:

I set a small challenge of building a wrapper around the Hacker News API. To keep the project simple and focus on the goal of studying idiomatic Rust, I only aggregated the top stories (i.e. frontpage matter) and ignored all other site categories (polls, jobs, etc.).

** Understanding the data structure
- Stories can have /many/ children
- Comments can have /many/ children
- Comments can have /only one/ parent

Both sotries and comments are "items". You may be able to spot a simple rule here:

- Stories are /always/ parents. Comments can be either parents /or/ children.

** Defining the item type
First, I defined the item type. 


